<?php

// их статус => наш субстатус
return [
    1 => 1, // Не заказывал
    2 => 2, // Нашел дешевле
    3 => 3, // Не устр. дост.
    4 => 4, // Hекорректные данные
    5 => 5, // Дубль
    6 => 6, // Неверное GEO
    7 => 7, // Нету доставки в этот регион
    8 => 8, // Консультация по товару
    9 => 9, // Консультация по возврату
    10 => 10, // Абонент недоступен больше недели
    11 => 11, // Изменение GEO
    12 => 12, // Другая причина
    13 => 13, // Консультация по пред. заявке
    14 => 14, // Тест
    15 => 15, // Дорого
    16 => 16, // Передумал
    17 => 17, // Не предоставляет всех данных для подтверждения
    18 => 18, // Глухой/немой, не говорит внятно
    19 => 19, // Не поддерживаемое GEO
    20 => 20, // Превышение лимита
];