<?php
declare(strict_types=1);

return [
    'on_create_error' => 'Не удалось добавить гео цель',
    'on_create_success' => 'Гео цель успешно добавлена',

    'on_edit_error' => 'Не удалось отредактировать гео цель',
    'on_edit_success' => 'Гео цель успешно отредактирована',

    'on_delete_error' => 'Не удалось удалить гео цель',
    'on_delete_success' => 'Гео цель успешно удалена',

    'on_clone_error' => 'Не удалось клонироваль гео цель',
    'on_clone_success' => 'Гео цель успешно клонирована',

    'on_get_error' => 'Не удалось получить гео цель',
    'on_get_list_error' => 'Не удалось получить список гео целей',

    // Validation Rules
    'id.exists' => 'Нельзя удалять гео цель по умолчанию или некорректный идентификатор',

];